app/controllers/school_classes_controller.rb

	def create
	  @school_class = SchoolClass.new(params.require(:school_class))
	  # @school_class.title = params[:title]
	  # @school_class.room_number = params[:room_number]
	  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "English"], ["room_number", 101], ["created_at", "2018-11-28 09:55:16.443946"], ["updated_at", "2018-11-28 09:55:16.443946"]]

	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(params.require(:school_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 71], ["updated_at", "2018-11-28 10:44:44.911315"], ["id", 1]]