app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lets "], ["last_name", "Go"], ["created_at", "2018-11-28 11:31:48.316704"], ["updated_at", "2018-11-28 11:31:48.316704"]]

  def update
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2018-11-28 11:26:31.071086"], ["id", 1]]